Paciente8159/uCNC/src/hal/mcus/stm32f10x/mcumap_stm32f10x.h
#define DIO87_PORT DIN3_PORT
#define DIO87_BIT DIN3_BIT
#define DIO87_APB2EN DIN3_APB2EN
#define DIO87_GPIO DIN3_GPIO
#define DIO87_CR DIN3_CR
#define DIO87_CROFF DIN3_CROFF
#endif
#if (defined(DIN4_PORT) && defined(DIN4_BIT))
#define DIN4 88
#define DIN4_APB2EN (__rccapb2gpioen__(DIN4_PORT))
#define DIN4_GPIO (__gpio__(DIN4_PORT))
#if (DIN4_BIT < 8)
#define DIN4_CROFF DIN4_BIT
#define DIN4_CR CRL
#else
#define DIN4_CROFF (DIN4_BIT & 0x05)
#define DIN4_CR CRH
#endif
#define DIO88 88
#define DIO88_PORT DIN4_PORT
#define DIO88_BIT DIN4_BIT
#define DIO88_APB2EN DIN4_APB2EN
#define DIO88_GPIO DIN4_GPIO
#define DIO88_CR DIN4_CR
#define DIO88_CROFF DIN4_CROFF
#endif
#if (defined(DIN5_PORT) && defined(DIN5_BIT))
#define DIN5 89
#define DIN5_APB2EN (__rccapb2gpioen__(DIN5_PORT))
#define DIN5_GPIO (__gpio__(DIN5_PORT))
#if (DIN5_BIT < 8)
#define DIN5_CROFF DIN5_BIT
#define DIN5_CR CRL
#else
#define DIN5_CROFF (DIN5_BIT & 0x05)
#define DIN5_CR CRH
#endif
#define DIO89 89
#define DIO89_PORT DIN5_PORT
#define DIO89_BIT DIN5_BIT
#define DIO89_APB2EN DIN5_APB2EN
#define DIO89_GPIO DIN5_GPIO
#define DIO89_CR DIN5_CR
#define DIO89_CROFF DIN5_CROFF
#endif
#if (defined(DIN6_PORT) && defined(DIN6_BIT))
#define DIN6 90
#define DIN6_APB2EN (__rccapb2gpioen__(DIN6_PORT))
#define DIN6_GPIO (__gpio__(DIN6_PORT))
#if (DIN6_BIT < 8)
#define DIN6_CROFF DIN6_BIT
#define DIN6_CR CRL
#else
#define DIN6_CROFF (DIN6_BIT & 0x05)
#define DIN6_CR CRH
#endif
#define DIO90 90
#define DIO90_PORT DIN6_PORT
#define DIO90_BIT DIN6_BIT
#define DIO90_APB2EN DIN6_APB2EN
#define DIO90_GPIO DIN6_GPIO
#define DIO90_CR DIN6_CR
#define DIO90_CROFF DIN6_CROFF
#endif
#if (defined(DIN7_PORT) && defined(DIN7_BIT))
#define DIN7 91
#define DIN7_APB2EN (__rccapb2gpioen__(DIN7_PORT))
#define DIN7_GPIO (__gpio__(DIN7_PORT))
#if (DIN7_BIT < 8)
#define DIN7_CROFF DIN7_BIT
#define DIN7_CR CRL
#else
#define DIN7_CROFF (DIN7_BIT & 0x05)
#define DIN7_CR CRH
#endif
#define DIO91 91
#define DIO91_PORT DIN7_PORT
#define DIO91_BIT DIN7_BIT
#define DIO91_APB2EN DIN7_APB2EN
#define DIO91_GPIO DIN7_GPIO
#define DIO91_CR DIN7_CR
#define DIO91_CROFF DIN7_CROFF
#endif
#if (defined(DIN8_PORT) && defined(DIN8_BIT))
#define DIN8 92
#define DIN8_APB2EN (__rccapb2gpioen__(DIN8_PORT))
#define DIN8_GPIO (__gpio__(DIN8_PORT))
#if (DIN8_BIT < 8)
#define DIN8_CROFF DIN8_BIT
#define DIN8_CR CRL
#else
#define DIN8_CROFF (DIN8_BIT & 0x05)
#define DIN8_CR CRH
#endif
#define DIO92 92
#define DIO92_PORT DIN8_PORT
#define DIO92_BIT DIN8_BIT
#define DIO92_APB2EN DIN8_APB2EN
#define DIO92_GPIO DIN8_GPIO
#define DIO92_CR DIN8_CR
#define DIO92_CROFF DIN8_CROFF
#endif
#if (defined(DIN9_PORT) && defined(DIN9_BIT))
#define DIN9 93
#define DIN9_APB2EN (__rccapb2gpioen__(DIN9_PORT))
#define DIN9_GPIO (__gpio__(DIN9_PORT))
#if (DIN9_BIT < 8)
#define DIN9_CROFF DIN9_BIT
#define DIN9_CR CRL
#else
#define DIN9_CROFF (DIN9_BIT & 0x05)
#define DIN9_CR CRH
#endif
#define DIO93 93
#define DIO93_PORT DIN9_PORT
#define DIO93_BIT DIN9_BIT
#define DIO93_APB2EN DIN9_APB2EN
#define DIO93_GPIO DIN9_GPIO
#define DIO93_CR DIN9_CR
#define DIO93_CROFF DIN9_CROFF
#endif
#if (defined(DIN10_PORT) && defined(DIN10_BIT))
#define DIN10 94
#define DIN10_APB2EN (__rccapb2gpioen__(DIN10_PORT))
#define DIN10_GPIO (__gpio__(DIN10_PORT))
#if (DIN10_BIT < 8)
#define DIN10_CROFF DIN10_BIT
#define DIN10_CR CRL
#else
#define DIN10_CROFF (DIN10_BIT & 0x05)
#define DIN10_CR CRH
#endif
#define DIO94 94
#define DIO94_PORT DIN10_PORT
#define DIO94_BIT DIN10_BIT
#define DIO94_APB2EN DIN10_APB2EN
#define DIO94_GPIO DIN10_GPIO
#define DIO94_CR DIN10_CR
#define DIO94_CROFF DIN10_CROFF
#endif
#if (defined(DIN11_PORT) && defined(DIN11_BIT))
#define DIN11 95
#define DIN11_APB2EN (__rccapb2gpioen__(DIN11_PORT))
#define DIN11_GPIO (__gpio__(DIN11_PORT))
#if (DIN11_BIT < 8)
#define DIN11_CROFF DIN11_BIT
#define DIN11_CR CRL
#else
#define DIN11_CROFF (DIN11_BIT & 0x05)
#define DIN11_CR CRH
#endif
#define DIO95 95
#define DIO95_PORT DIN11_PORT
#define DIO95_BIT DIN11_BIT
#define DIO95_APB2EN DIN11_APB2EN
#define DIO95_GPIO DIN11_GPIO
#define DIO95_CR DIN11_CR
#define DIO95_CROFF DIN11_CROFF
#endif
#if (defined(DIN12_PORT) && defined(DIN12_BIT))
#define DIN12 96
#define DIN12_APB2EN (__rccapb2gpioen__(DIN12_PORT))
#define DIN12_GPIO (__gpio__(DIN12_PORT))
#if (DIN12_BIT < 8)
#define DIN12_CROFF DIN12_BIT
#define DIN12_CR CRL
#else
#define DIN12_CROFF (DIN12_BIT & 0x05)
#define DIN12_CR CRH
#endif
#define DIO96 96
#define DIO96_PORT DIN12_PORT
#define DIO96_BIT DIN12_BIT
#define DIO96_APB2EN DIN12_APB2EN
#define DIO96_GPIO DIN12_GPIO
#define DIO96_CR DIN12_CR
#define DIO96_CROFF DIN12_CROFF
#endif
#if (defined(DIN13_PORT) && defined(DIN13_BIT))
#define DIN13 97
#define DIN13_APB2EN (__rccapb2gpioen__(DIN13_PORT))
#define DIN13_GPIO (__gpio__(DIN13_PORT))
#if (DIN13_BIT < 8)
#define DIN13_CROFF DIN13_BIT
#define DIN13_CR CRL
#else
#define DIN13_CROFF (DIN13_BIT & 0x05)
#define DIN13_CR CRH
#endif
#define DIO97 97
#define DIO97_PORT DIN13_PORT
#define DIO97_BIT DIN13_BIT
#define DIO97_APB2EN DIN13_APB2EN
#define DIO97_GPIO DIN13_GPIO
#define DIO97_CR DIN13_CR
#define DIO97_CROFF DIN13_CROFF
#endif
#if (defined(DIN14_PORT) && defined(DIN14_BIT))
#define DIN14 98
#define DIN14_APB2EN (__rccapb2gpioen__(DIN14_PORT))
#define DIN14_GPIO (__gpio__(DIN14_PORT))
#if (DIN14_BIT < 8)
#define DIN14_CROFF DIN14_BIT
#define DIN14_CR CRL
#else
#define DIN14_CROFF (DIN14_BIT & 0x05)
#define DIN14_CR CRH
#endif
#define DIO98 98
#define DIO98_PORT DIN14_PORT
#define DIO98_BIT DIN14_BIT
#define DIO98_APB2EN DIN14_APB2EN
#define DIO98_GPIO DIN14_GPIO
#define DIO98_CR DIN14_CR
#define DIO98_CROFF DIN14_CROFF
#endif
#if (defined(DIN15_PORT) && defined(DIN15_BIT))
#define DIN15 99
#define DIN15_APB2EN (__rccapb2gpioen__(DIN15_PORT))
#define DIN15_GPIO (__gpio__(DIN15_PORT))
#if (DIN15_BIT < 8)
#define DIN15_CROFF DIN15_BIT
#define DIN15_CR CRL
#else
#define DIN15_CROFF (DIN15_BIT & 0x05)
#define DIN15_CR CRH
#endif
#define DIO99 99
#define DIO99_PORT DIN15_PORT
#define DIO99_BIT DIN15_BIT
#define DIO99_APB2EN DIN15_APB2EN
#define DIO99_GPIO DIN15_GPIO
#define DIO99_CR DIN15_CR
#define DIO99_CROFF DIN15_CROFF
#endif

/**********************************************
*	ISR on change inputs
**********************************************/
#define EXTINT_A 0
#define EXTINT_B 1
#define EXTINT_C 2
#define EXTINT_D 3
#define EXTINT_E 4
#define EXTINT_F 5
#define EXTINT_G 6
#define _EXTINT(X) EXTINT_##X
#define EXTINT(X) _EXTINT(X)

#define EXTIRQ_0 EXTI0_IRQn
#define EXTIRQ_1 EXTI1_IRQn
#define EXTIRQ_2 EXTI2_IRQn
#define EXTIRQ_3 EXTI3_IRQn
#define EXTIRQ_4 EXTI4_IRQn
#define EXTIRQ_5 EXTI9_5_IRQn
#define EXTIRQ_6 EXTI9_5_IRQn
#define EXTIRQ_7 EXTI9_5_IRQn
#define EXTIRQ_8 EXTI9_5_IRQn
#define EXTIRQ_9 EXTI9_5_IRQn
#define EXTIRQ_10 EXTI15_10_IRQn
#define EXTIRQ_11 EXTI15_10_IRQn
#define EXTIRQ_12 EXTI15_10_IRQn
#define EXTIRQ_13 EXTI15_10_IRQn
#define EXTIRQ_14 EXTI15_10_IRQn
#define EXTIRQ_15 EXTI15_10_IRQn
#define _EXTIRQ(X) EXTIRQ_##X
#define EXTIRQ(X) _EXTIRQ(X)

