Paciente8159/uCNC/src/hal/mcus/stm32f10x/mcumap_stm32f10x.h
/**********************************************
*	PWM pins
**********************************************/
#if (defined(PWM0_CHANNEL) && defined(PWM0_TIMER) && defined(PWM0))
#if (PWM0_TIMER == 1 || (PWM0_TIMER >= 8 & PWM0_TIMER <= 11))
#define PWM0_ENREG RCC->APB2ENR
#define PWM0_APBEN __helper__(RCC_APB2ENR_TIM, PWM0_TIMER, EN)
#else
#define PWM0_ENREG RCC->APB1ENR
#define PWM0_APBEN __helper__(RCC_APB1ENR_TIM, PWM0_TIMER, EN)
#endif
#define PWM0_TIMREG (__tim__(PWM0_TIMER))
#ifndef PWM0_FREQ
#define PWM0_FREQ 1000
#endif
#if (PWM0_CHANNEL & 0x01)
#define PWM0_MODE 0x0064
#else
#define PWM0_MODE 0x6400
#endif
#if (PWM0_CHANNEL > 2)
#define PWM0_CCMREG CCMR2
#else
#define PWM0_CCMREG CCMR1
#endif
#if (PWM0_TIMER == 1)
#define PWM0_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM0_TIMER == 8)
#define PWM0_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM0_ENOUTPUT \
	{                 \
	}
#endif
#define PWM0_CCR __ccr__(PWM0_CHANNEL)
#define DIO20_TIMER PWM0_TIMER
#define DIO20_CHANNEL PWM0_CHANNEL
#define DIO20_ENREG PWM0_ENREG
#define DIO20_APBEN PWM0_APBEN
#define DIO20_TIMREG PWM0_TIMREG
#define DIO20_APBEN PWM0_APBEN
#define DIO20_FREQ PWM0_FREQ
#define DIO20_MODE PWM0_MODE
#define DIO20_CCMREG PWM0_CCMREG
#define DIO20_CCR PWM0_CCR
#define DIO20_ENOUTPUT PWM0_ENOUTPUT
#endif
#if (defined(PWM1_CHANNEL) && defined(PWM1_TIMER) && defined(PWM1))
#if (PWM1_TIMER == 1 || (PWM1_TIMER >= 8 & PWM1_TIMER <= 11))
#define PWM1_ENREG RCC->APB2ENR
#define PWM1_APBEN __helper__(RCC_APB2ENR_TIM, PWM1_TIMER, EN)
#else
#define PWM1_ENREG RCC->APB1ENR
#define PWM1_APBEN __helper__(RCC_APB1ENR_TIM, PWM1_TIMER, EN)
#endif
#define PWM1_TIMREG (__tim__(PWM1_TIMER))
#ifndef PWM1_FREQ
#define PWM1_FREQ 1000
#endif
#if (PWM1_CHANNEL & 0x01)
#define PWM1_MODE 0x0064
#else
#define PWM1_MODE 0x6400
#endif
#if (PWM1_CHANNEL > 2)
#define PWM1_CCMREG CCMR2
#else
#define PWM1_CCMREG CCMR1
#endif
#if (PWM1_TIMER == 1)
#define PWM1_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM1_TIMER == 8)
#define PWM1_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM1_ENOUTPUT \
	{                 \
	}
#endif
#define PWM1_CCR __ccr__(PWM1_CHANNEL)
#define DIO21_TIMER PWM1_TIMER
#define DIO21_CHANNEL PWM1_CHANNEL
#define DIO21_ENREG PWM1_ENREG
#define DIO21_APBEN PWM1_APBEN
#define DIO21_TIMREG PWM1_TIMREG
#define DIO21_APBEN PWM1_APBEN
#define DIO21_FREQ PWM1_FREQ
#define DIO21_MODE PWM1_MODE
#define DIO21_CCMREG PWM1_CCMREG
#define DIO21_CCR PWM1_CCR
#define DIO21_ENOUTPUT PWM1_ENOUTPUT
#endif
#if (defined(PWM2_CHANNEL) && defined(PWM2_TIMER) && defined(PWM2))
#if (PWM2_TIMER == 1 || (PWM2_TIMER >= 8 & PWM2_TIMER <= 11))
#define PWM2_ENREG RCC->APB2ENR
#define PWM2_APBEN __helper__(RCC_APB2ENR_TIM, PWM2_TIMER, EN)
#else
#define PWM2_ENREG RCC->APB1ENR
#define PWM2_APBEN __helper__(RCC_APB1ENR_TIM, PWM2_TIMER, EN)
#endif
#define PWM2_TIMREG (__tim__(PWM2_TIMER))
#ifndef PWM2_FREQ
#define PWM2_FREQ 1000
#endif
#if (PWM2_CHANNEL & 0x01)
#define PWM2_MODE 0x0064
#else
#define PWM2_MODE 0x6400
#endif
#if (PWM2_CHANNEL > 2)
#define PWM2_CCMREG CCMR2
#else
#define PWM2_CCMREG CCMR1
#endif
#if (PWM2_TIMER == 1)
#define PWM2_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM2_TIMER == 8)
#define PWM2_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM2_ENOUTPUT \
	{                 \
	}
#endif
#define PWM2_CCR __ccr__(PWM2_CHANNEL)
#define DIO22_TIMER PWM2_TIMER
#define DIO22_CHANNEL PWM2_CHANNEL
#define DIO22_ENREG PWM2_ENREG
#define DIO22_APBEN PWM2_APBEN
#define DIO22_TIMREG PWM2_TIMREG
#define DIO22_APBEN PWM2_APBEN
#define DIO22_FREQ PWM2_FREQ
#define DIO22_MODE PWM2_MODE
#define DIO22_CCMREG PWM2_CCMREG
#define DIO22_CCR PWM2_CCR
#define DIO22_ENOUTPUT PWM2_ENOUTPUT
#endif
#if (defined(PWM3_CHANNEL) && defined(PWM3_TIMER) && defined(PWM3))
#if (PWM3_TIMER == 1 || (PWM3_TIMER >= 8 & PWM3_TIMER <= 11))
#define PWM3_ENREG RCC->APB2ENR
#define PWM3_APBEN __helper__(RCC_APB2ENR_TIM, PWM3_TIMER, EN)
#else
#define PWM3_ENREG RCC->APB1ENR
#define PWM3_APBEN __helper__(RCC_APB1ENR_TIM, PWM3_TIMER, EN)
#endif
#define PWM3_TIMREG (__tim__(PWM3_TIMER))
#ifndef PWM3_FREQ
#define PWM3_FREQ 1000
#endif
#if (PWM3_CHANNEL & 0x01)
#define PWM3_MODE 0x0064
#else
#define PWM3_MODE 0x6400
#endif
#if (PWM3_CHANNEL > 2)
#define PWM3_CCMREG CCMR2
#else
#define PWM3_CCMREG CCMR1
#endif
#if (PWM3_TIMER == 1)
#define PWM3_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM3_TIMER == 8)
#define PWM3_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM3_ENOUTPUT \
	{                 \
	}
#endif
#define PWM3_CCR __ccr__(PWM3_CHANNEL)
#define DIO23_TIMER PWM3_TIMER
#define DIO23_CHANNEL PWM3_CHANNEL
#define DIO23_ENREG PWM3_ENREG
#define DIO23_APBEN PWM3_APBEN
#define DIO23_TIMREG PWM3_TIMREG
#define DIO23_APBEN PWM3_APBEN
#define DIO23_FREQ PWM3_FREQ
#define DIO23_MODE PWM3_MODE
#define DIO23_CCMREG PWM3_CCMREG
#define DIO23_CCR PWM3_CCR
#define DIO23_ENOUTPUT PWM3_ENOUTPUT
#endif
#if (defined(PWM4_CHANNEL) && defined(PWM4_TIMER) && defined(PWM4))
#if (PWM4_TIMER == 1 || (PWM4_TIMER >= 8 & PWM4_TIMER <= 11))
#define PWM4_ENREG RCC->APB2ENR
#define PWM4_APBEN __helper__(RCC_APB2ENR_TIM, PWM4_TIMER, EN)
#else
#define PWM4_ENREG RCC->APB1ENR
#define PWM4_APBEN __helper__(RCC_APB1ENR_TIM, PWM4_TIMER, EN)
#endif
#define PWM4_TIMREG (__tim__(PWM4_TIMER))
#ifndef PWM4_FREQ
#define PWM4_FREQ 1000
#endif
#if (PWM4_CHANNEL & 0x01)
#define PWM4_MODE 0x0064
#else
#define PWM4_MODE 0x6400
#endif
#if (PWM4_CHANNEL > 2)
#define PWM4_CCMREG CCMR2
#else
#define PWM4_CCMREG CCMR1
#endif
#if (PWM4_TIMER == 1)
#define PWM4_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM4_TIMER == 8)
#define PWM4_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM4_ENOUTPUT \
	{                 \
	}
#endif
#define PWM4_CCR __ccr__(PWM4_CHANNEL)
#define DIO24_TIMER PWM4_TIMER
#define DIO24_CHANNEL PWM4_CHANNEL
#define DIO24_ENREG PWM4_ENREG
#define DIO24_APBEN PWM4_APBEN
#define DIO24_TIMREG PWM4_TIMREG
#define DIO24_APBEN PWM4_APBEN
#define DIO24_FREQ PWM4_FREQ
#define DIO24_MODE PWM4_MODE
#define DIO24_CCMREG PWM4_CCMREG
#define DIO24_CCR PWM4_CCR
#define DIO24_ENOUTPUT PWM4_ENOUTPUT
#endif
#if (defined(PWM5_CHANNEL) && defined(PWM5_TIMER) && defined(PWM5))
#if (PWM5_TIMER == 1 || (PWM5_TIMER >= 8 & PWM5_TIMER <= 11))
#define PWM5_ENREG RCC->APB2ENR
#define PWM5_APBEN __helper__(RCC_APB2ENR_TIM, PWM5_TIMER, EN)
#else
#define PWM5_ENREG RCC->APB1ENR
#define PWM5_APBEN __helper__(RCC_APB1ENR_TIM, PWM5_TIMER, EN)
#endif
#define PWM5_TIMREG (__tim__(PWM5_TIMER))
#ifndef PWM5_FREQ
#define PWM5_FREQ 1000
#endif
#if (PWM5_CHANNEL & 0x01)
#define PWM5_MODE 0x0064
#else
#define PWM5_MODE 0x6400
#endif
#if (PWM5_CHANNEL > 2)
#define PWM5_CCMREG CCMR2
#else
#define PWM5_CCMREG CCMR1
#endif
#if (PWM5_TIMER == 1)
#define PWM5_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM5_TIMER == 8)
#define PWM5_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM5_ENOUTPUT \
	{                 \
	}
#endif
#define PWM5_CCR __ccr__(PWM5_CHANNEL)
#define DIO25_TIMER PWM5_TIMER
#define DIO25_CHANNEL PWM5_CHANNEL
#define DIO25_ENREG PWM5_ENREG
#define DIO25_APBEN PWM5_APBEN
#define DIO25_TIMREG PWM5_TIMREG
#define DIO25_APBEN PWM5_APBEN
#define DIO25_FREQ PWM5_FREQ
#define DIO25_MODE PWM5_MODE
#define DIO25_CCMREG PWM5_CCMREG
#define DIO25_CCR PWM5_CCR
#define DIO25_ENOUTPUT PWM5_ENOUTPUT
#endif
#if (defined(PWM6_CHANNEL) && defined(PWM6_TIMER) && defined(PWM6))
#if (PWM6_TIMER == 1 || (PWM6_TIMER >= 8 & PWM6_TIMER <= 11))
#define PWM6_ENREG RCC->APB2ENR
#define PWM6_APBEN __helper__(RCC_APB2ENR_TIM, PWM6_TIMER, EN)
#else
#define PWM6_ENREG RCC->APB1ENR
#define PWM6_APBEN __helper__(RCC_APB1ENR_TIM, PWM6_TIMER, EN)
#endif
#define PWM6_TIMREG (__tim__(PWM6_TIMER))
#ifndef PWM6_FREQ
#define PWM6_FREQ 1000
#endif
#if (PWM6_CHANNEL & 0x01)
#define PWM6_MODE 0x0064
#else
#define PWM6_MODE 0x6400
#endif
#if (PWM6_CHANNEL > 2)
#define PWM6_CCMREG CCMR2
#else
#define PWM6_CCMREG CCMR1
#endif
#if (PWM6_TIMER == 1)
#define PWM6_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM6_TIMER == 8)
#define PWM6_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM6_ENOUTPUT \
	{                 \
	}
#endif
#define PWM6_CCR __ccr__(PWM6_CHANNEL)
#define DIO26_TIMER PWM6_TIMER
#define DIO26_CHANNEL PWM6_CHANNEL
#define DIO26_ENREG PWM6_ENREG
#define DIO26_APBEN PWM6_APBEN
#define DIO26_TIMREG PWM6_TIMREG
#define DIO26_APBEN PWM6_APBEN
#define DIO26_FREQ PWM6_FREQ
#define DIO26_MODE PWM6_MODE
#define DIO26_CCMREG PWM6_CCMREG
#define DIO26_CCR PWM6_CCR
#define DIO26_ENOUTPUT PWM6_ENOUTPUT
#endif
#if (defined(PWM7_CHANNEL) && defined(PWM7_TIMER) && defined(PWM7))
#if (PWM7_TIMER == 1 || (PWM7_TIMER >= 8 & PWM7_TIMER <= 11))
#define PWM7_ENREG RCC->APB2ENR
#define PWM7_APBEN __helper__(RCC_APB2ENR_TIM, PWM7_TIMER, EN)
#else
#define PWM7_ENREG RCC->APB1ENR
#define PWM7_APBEN __helper__(RCC_APB1ENR_TIM, PWM7_TIMER, EN)
#endif
#define PWM7_TIMREG (__tim__(PWM7_TIMER))
#ifndef PWM7_FREQ
#define PWM7_FREQ 1000
#endif
#if (PWM7_CHANNEL & 0x01)
#define PWM7_MODE 0x0064
#else
#define PWM7_MODE 0x6400
#endif
#if (PWM7_CHANNEL > 2)
#define PWM7_CCMREG CCMR2
#else
#define PWM7_CCMREG CCMR1
#endif
#if (PWM7_TIMER == 1)
#define PWM7_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM7_TIMER == 8)
#define PWM7_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM7_ENOUTPUT \
	{                 \
	}
#endif
#define PWM7_CCR __ccr__(PWM7_CHANNEL)
#define DIO27_TIMER PWM7_TIMER
#define DIO27_CHANNEL PWM7_CHANNEL
#define DIO27_ENREG PWM7_ENREG
#define DIO27_APBEN PWM7_APBEN
#define DIO27_TIMREG PWM7_TIMREG
#define DIO27_APBEN PWM7_APBEN
#define DIO27_FREQ PWM7_FREQ
#define DIO27_MODE PWM7_MODE
#define DIO27_CCMREG PWM7_CCMREG
#define DIO27_CCR PWM7_CCR
#define DIO27_ENOUTPUT PWM7_ENOUTPUT
#endif
#if (defined(PWM8_CHANNEL) && defined(PWM8_TIMER) && defined(PWM8))
#if (PWM8_TIMER == 1 || (PWM8_TIMER >= 8 & PWM8_TIMER <= 11))
#define PWM8_ENREG RCC->APB2ENR
#define PWM8_APBEN __helper__(RCC_APB2ENR_TIM, PWM8_TIMER, EN)
#else
#define PWM8_ENREG RCC->APB1ENR
#define PWM8_APBEN __helper__(RCC_APB1ENR_TIM, PWM8_TIMER, EN)
#endif
#define PWM8_TIMREG (__tim__(PWM8_TIMER))
#ifndef PWM8_FREQ
#define PWM8_FREQ 1000
#endif
#if (PWM8_CHANNEL & 0x01)
#define PWM8_MODE 0x0064
#else
#define PWM8_MODE 0x6400
#endif
#if (PWM8_CHANNEL > 2)
#define PWM8_CCMREG CCMR2
#else
#define PWM8_CCMREG CCMR1
#endif
#if (PWM8_TIMER == 1)
#define PWM8_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM8_TIMER == 8)
#define PWM8_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM8_ENOUTPUT \
	{                 \
	}
#endif
#define PWM8_CCR __ccr__(PWM8_CHANNEL)
#define DIO28_TIMER PWM8_TIMER
#define DIO28_CHANNEL PWM8_CHANNEL
#define DIO28_ENREG PWM8_ENREG
#define DIO28_APBEN PWM8_APBEN
#define DIO28_TIMREG PWM8_TIMREG
#define DIO28_APBEN PWM8_APBEN
#define DIO28_FREQ PWM8_FREQ
#define DIO28_MODE PWM8_MODE
#define DIO28_CCMREG PWM8_CCMREG
#define DIO28_CCR PWM8_CCR
#define DIO28_ENOUTPUT PWM8_ENOUTPUT
#endif
#if (defined(PWM9_CHANNEL) && defined(PWM9_TIMER) && defined(PWM9))
#if (PWM9_TIMER == 1 || (PWM9_TIMER >= 8 & PWM9_TIMER <= 11))
#define PWM9_ENREG RCC->APB2ENR
#define PWM9_APBEN __helper__(RCC_APB2ENR_TIM, PWM9_TIMER, EN)
#else
#define PWM9_ENREG RCC->APB1ENR
#define PWM9_APBEN __helper__(RCC_APB1ENR_TIM, PWM9_TIMER, EN)
#endif
#define PWM9_TIMREG (__tim__(PWM9_TIMER))
#ifndef PWM9_FREQ
#define PWM9_FREQ 1000
#endif
#if (PWM9_CHANNEL & 0x01)
#define PWM9_MODE 0x0064
#else
#define PWM9_MODE 0x6400
#endif
#if (PWM9_CHANNEL > 2)
#define PWM9_CCMREG CCMR2
#else
#define PWM9_CCMREG CCMR1
#endif
#if (PWM9_TIMER == 1)
#define PWM9_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM9_TIMER == 8)
#define PWM9_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM9_ENOUTPUT \
	{                 \
	}
#endif
#define PWM9_CCR __ccr__(PWM9_CHANNEL)
#define DIO29_TIMER PWM9_TIMER
#define DIO29_CHANNEL PWM9_CHANNEL
#define DIO29_ENREG PWM9_ENREG
#define DIO29_APBEN PWM9_APBEN
#define DIO29_TIMREG PWM9_TIMREG
#define DIO29_APBEN PWM9_APBEN
#define DIO29_FREQ PWM9_FREQ
#define DIO29_MODE PWM9_MODE
#define DIO29_CCMREG PWM9_CCMREG
#define DIO29_CCR PWM9_CCR
#define DIO29_ENOUTPUT PWM9_ENOUTPUT
#endif
#if (defined(PWM10_CHANNEL) && defined(PWM10_TIMER) && defined(PWM10))
#if (PWM10_TIMER == 1 || (PWM10_TIMER >= 8 & PWM10_TIMER <= 11))
#define PWM10_ENREG RCC->APB2ENR
#define PWM10_APBEN __helper__(RCC_APB2ENR_TIM, PWM10_TIMER, EN)
#else
#define PWM10_ENREG RCC->APB1ENR
#define PWM10_APBEN __helper__(RCC_APB1ENR_TIM, PWM10_TIMER, EN)
#endif
#define PWM10_TIMREG (__tim__(PWM10_TIMER))
#ifndef PWM10_FREQ
#define PWM10_FREQ 1000
#endif
#if (PWM10_CHANNEL & 0x01)
#define PWM10_MODE 0x0064
#else
#define PWM10_MODE 0x6400
#endif
#if (PWM10_CHANNEL > 2)
#define PWM10_CCMREG CCMR2
#else
#define PWM10_CCMREG CCMR1
#endif
#if (PWM10_TIMER == 1)
#define PWM10_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM10_TIMER == 8)
#define PWM10_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM10_ENOUTPUT \
	{                  \
	}
#endif
#define PWM10_CCR __ccr__(PWM10_CHANNEL)
#define DIO30_TIMER PWM10_TIMER
#define DIO30_CHANNEL PWM10_CHANNEL
#define DIO30_ENREG PWM10_ENREG
#define DIO30_APBEN PWM10_APBEN
#define DIO30_TIMREG PWM10_TIMREG
#define DIO30_APBEN PWM10_APBEN
#define DIO30_FREQ PWM10_FREQ
#define DIO30_MODE PWM10_MODE
#define DIO30_CCMREG PWM10_CCMREG
#define DIO30_CCR PWM10_CCR
#define DIO30_ENOUTPUT PWM10_ENOUTPUT
#endif
#if (defined(PWM11_CHANNEL) && defined(PWM11_TIMER) && defined(PWM11))
#if (PWM11_TIMER == 1 || (PWM11_TIMER >= 8 & PWM11_TIMER <= 11))
#define PWM11_ENREG RCC->APB2ENR
#define PWM11_APBEN __helper__(RCC_APB2ENR_TIM, PWM11_TIMER, EN)
#else
#define PWM11_ENREG RCC->APB1ENR
#define PWM11_APBEN __helper__(RCC_APB1ENR_TIM, PWM11_TIMER, EN)
#endif
#define PWM11_TIMREG (__tim__(PWM11_TIMER))
#ifndef PWM11_FREQ
#define PWM11_FREQ 1000
#endif
#if (PWM11_CHANNEL & 0x01)
#define PWM11_MODE 0x0064
#else
#define PWM11_MODE 0x6400
#endif
#if (PWM11_CHANNEL > 2)
#define PWM11_CCMREG CCMR2
#else
#define PWM11_CCMREG CCMR1
#endif
#if (PWM11_TIMER == 1)
#define PWM11_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM11_TIMER == 8)
#define PWM11_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM11_ENOUTPUT \
	{                  \
	}
#endif
#define PWM11_CCR __ccr__(PWM11_CHANNEL)
#define DIO31_TIMER PWM11_TIMER
#define DIO31_CHANNEL PWM11_CHANNEL
#define DIO31_ENREG PWM11_ENREG
#define DIO31_APBEN PWM11_APBEN
#define DIO31_TIMREG PWM11_TIMREG
#define DIO31_APBEN PWM11_APBEN
#define DIO31_FREQ PWM11_FREQ
#define DIO31_MODE PWM11_MODE
#define DIO31_CCMREG PWM11_CCMREG
#define DIO31_CCR PWM11_CCR
#define DIO31_ENOUTPUT PWM11_ENOUTPUT
#endif
#if (defined(PWM12_CHANNEL) && defined(PWM12_TIMER) && defined(PWM12))
#if (PWM12_TIMER == 1 || (PWM12_TIMER >= 8 & PWM12_TIMER <= 11))
#define PWM12_ENREG RCC->APB2ENR
#define PWM12_APBEN __helper__(RCC_APB2ENR_TIM, PWM12_TIMER, EN)
#else
#define PWM12_ENREG RCC->APB1ENR
#define PWM12_APBEN __helper__(RCC_APB1ENR_TIM, PWM12_TIMER, EN)
#endif
#define PWM12_TIMREG (__tim__(PWM12_TIMER))
#ifndef PWM12_FREQ
#define PWM12_FREQ 1000
#endif
#if (PWM12_CHANNEL & 0x01)
#define PWM12_MODE 0x0064
#else
#define PWM12_MODE 0x6400
#endif
#if (PWM12_CHANNEL > 2)
#define PWM12_CCMREG CCMR2
#else
#define PWM12_CCMREG CCMR1
#endif
#if (PWM12_TIMER == 1)
#define PWM12_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM12_TIMER == 8)
#define PWM12_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM12_ENOUTPUT \
	{                  \
	}
#endif
#define PWM12_CCR __ccr__(PWM12_CHANNEL)
#define DIO32_TIMER PWM12_TIMER
#define DIO32_CHANNEL PWM12_CHANNEL
#define DIO32_ENREG PWM12_ENREG
#define DIO32_APBEN PWM12_APBEN
#define DIO32_TIMREG PWM12_TIMREG
#define DIO32_APBEN PWM12_APBEN
#define DIO32_FREQ PWM12_FREQ
#define DIO32_MODE PWM12_MODE
#define DIO32_CCMREG PWM12_CCMREG
#define DIO32_CCR PWM12_CCR
#define DIO32_ENOUTPUT PWM12_ENOUTPUT
#endif
#if (defined(PWM13_CHANNEL) && defined(PWM13_TIMER) && defined(PWM13))
#if (PWM13_TIMER == 1 || (PWM13_TIMER >= 8 & PWM13_TIMER <= 11))
#define PWM13_ENREG RCC->APB2ENR
#define PWM13_APBEN __helper__(RCC_APB2ENR_TIM, PWM13_TIMER, EN)
#else
#define PWM13_ENREG RCC->APB1ENR
#define PWM13_APBEN __helper__(RCC_APB1ENR_TIM, PWM13_TIMER, EN)
#endif
#define PWM13_TIMREG (__tim__(PWM13_TIMER))
#ifndef PWM13_FREQ
#define PWM13_FREQ 1000
#endif
#if (PWM13_CHANNEL & 0x01)
#define PWM13_MODE 0x0064
#else
#define PWM13_MODE 0x6400
#endif
#if (PWM13_CHANNEL > 2)
#define PWM13_CCMREG CCMR2
#else
#define PWM13_CCMREG CCMR1
#endif
#if (PWM13_TIMER == 1)
#define PWM13_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM13_TIMER == 8)
#define PWM13_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM13_ENOUTPUT \
	{                  \
	}
#endif
#define PWM13_CCR __ccr__(PWM13_CHANNEL)
#define DIO33_TIMER PWM13_TIMER
#define DIO33_CHANNEL PWM13_CHANNEL
#define DIO33_ENREG PWM13_ENREG
#define DIO33_APBEN PWM13_APBEN
#define DIO33_TIMREG PWM13_TIMREG
#define DIO33_APBEN PWM13_APBEN
#define DIO33_FREQ PWM13_FREQ
#define DIO33_MODE PWM13_MODE
#define DIO33_CCMREG PWM13_CCMREG
#define DIO33_CCR PWM13_CCR
#define DIO33_ENOUTPUT PWM13_ENOUTPUT
#endif
#if (defined(PWM14_CHANNEL) && defined(PWM14_TIMER) && defined(PWM14))
#if (PWM14_TIMER == 1 || (PWM14_TIMER >= 8 & PWM14_TIMER <= 11))
#define PWM14_ENREG RCC->APB2ENR
#define PWM14_APBEN __helper__(RCC_APB2ENR_TIM, PWM14_TIMER, EN)
#else
#define PWM14_ENREG RCC->APB1ENR
#define PWM14_APBEN __helper__(RCC_APB1ENR_TIM, PWM14_TIMER, EN)
#endif
#define PWM14_TIMREG (__tim__(PWM14_TIMER))
#ifndef PWM14_FREQ
#define PWM14_FREQ 1000
#endif
#if (PWM14_CHANNEL & 0x01)
#define PWM14_MODE 0x0064
#else
#define PWM14_MODE 0x6400
#endif
#if (PWM14_CHANNEL > 2)
#define PWM14_CCMREG CCMR2
#else
#define PWM14_CCMREG CCMR1
#endif
#if (PWM14_TIMER == 1)
#define PWM14_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM14_TIMER == 8)
#define PWM14_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM14_ENOUTPUT \
	{                  \
	}
#endif
#define PWM14_CCR __ccr__(PWM14_CHANNEL)
#define DIO34_TIMER PWM14_TIMER
#define DIO34_CHANNEL PWM14_CHANNEL
#define DIO34_ENREG PWM14_ENREG
#define DIO34_APBEN PWM14_APBEN
#define DIO34_TIMREG PWM14_TIMREG
#define DIO34_APBEN PWM14_APBEN
#define DIO34_FREQ PWM14_FREQ
#define DIO34_MODE PWM14_MODE
#define DIO34_CCMREG PWM14_CCMREG
#define DIO34_CCR PWM14_CCR
#define DIO34_ENOUTPUT PWM14_ENOUTPUT
#endif
#if (defined(PWM15_CHANNEL) && defined(PWM15_TIMER) && defined(PWM15))
#if (PWM15_TIMER == 1 || (PWM15_TIMER >= 8 & PWM15_TIMER <= 11))
#define PWM15_ENREG RCC->APB2ENR
#define PWM15_APBEN __helper__(RCC_APB2ENR_TIM, PWM15_TIMER, EN)
#else
#define PWM15_ENREG RCC->APB1ENR
#define PWM15_APBEN __helper__(RCC_APB1ENR_TIM, PWM15_TIMER, EN)
#endif
#define PWM15_TIMREG (__tim__(PWM15_TIMER))
#ifndef PWM15_FREQ
#define PWM15_FREQ 1000
#endif
#if (PWM15_CHANNEL & 0x01)
#define PWM15_MODE 0x0064
#else
#define PWM15_MODE 0x6400
#endif
#if (PWM15_CHANNEL > 2)
#define PWM15_CCMREG CCMR2
#else
#define PWM15_CCMREG CCMR1
#endif
#if (PWM15_TIMER == 1)
#define PWM15_ENOUTPUT ({ TIM1->BDTR |= (1 << 15); })
#elif (PWM15_TIMER == 8)
#define PWM15_ENOUTPUT ({ TIM8->BDTR |= (1 << 15); })
#else
#define PWM15_ENOUTPUT \
	{                  \
	}
#endif
#define PWM15_CCR __ccr__(PWM15_CHANNEL)
#define DIO35_TIMER PWM15_TIMER
#define DIO35_CHANNEL PWM15_CHANNEL
#define DIO35_ENREG PWM15_ENREG
#define DIO35_APBEN PWM15_APBEN
#define DIO35_TIMREG PWM15_TIMREG
#define DIO35_APBEN PWM15_APBEN
#define DIO35_FREQ PWM15_FREQ
#define DIO35_MODE PWM15_MODE
#define DIO35_CCMREG PWM15_CCMREG
#define DIO35_CCR PWM15_CCR
#define DIO35_ENOUTPUT PWM15_ENOUTPUT
#endif

/**********************************************
*	Analog pins
**********************************************/
/*
#ifdef ANALOG0
#define ANALOG0_ADMUXREG (1<<0)
#define DIO67_ADMUXREG (1<<0)
#endif
#ifdef ANALOG1
#define ANALOG1_ADMUXREG (1<<1)
#define DIO68_ADMUXREG (1<<1)
#endif
#ifdef ANALOG2
#define ANALOG2_ADMUXREG (1<<2)
#define DIO69_ADMUXREG (1<<2)
#endif
#ifdef ANALOG3
#define ANALOG3_ADMUXREG (1<<3)
#define DIO70_ADMUXREG (1<<3)
#endif
#ifdef ANALOG4
#define ANALOG4_ADMUXREG (1<<4)
#define DIO71_ADMUXREG (1<<4)
#endif
#ifdef ANALOG5
#define ANALOG5_ADMUXREG (1<<5)
#define DIO72_ADMUXREG (1<<5)
#endif
#ifdef ANALOG6
#define ANALOG6_ADMUXREG (1<<6)
#define DIO73_ADMUXREG (1<<6)
#endif
#ifdef ANALOG7
#define ANALOG7_ADMUXREG (1<<7)
#define DIO74_ADMUXREG (1<<7)
#endif
#ifdef ANALOG8
#define ANALOG8_ADMUXREG (1<<8)
#define DIO75_ADMUXREG (1<<8)
#endif
#ifdef ANALOG9
#define ANALOG9_ADMUXREG (1<<9)
#define DIO76_ADMUXREG (1<<9)
#endif
#ifdef ANALOG10
#define ANALOG10_ADMUXREG (1<<10)
#define DIO77_ADMUXREG (1<<10)
#endif
#ifdef ANALOG11
#define ANALOG11_ADMUXREG (1<<11)
#define DIO78_ADMUXREG (1<<11)
#endif
#ifdef ANALOG12
#define ANALOG12_ADMUXREG (1<<12)
#define DIO79_ADMUXREG (1<<12)
#endif
#ifdef ANALOG13
#define ANALOG13_ADMUXREG (1<<13)
#define DIO80_ADMUXREG (1<<13)
#endif
#ifdef ANALOG14
#define ANALOG14_ADMUXREG (1<<14)
#define DIO81_ADMUXREG (1<<14)
#endif
#ifdef ANALOG15
#define ANALOG15_ADMUXREG (1<<15)
#define DIO82_ADMUXREG (1<<15)
#endif
*/
//COM registers
#ifdef COM_PORT
//this MCU does not work well with both TX and RX interrupt
//this forces the sync TX method to fix communication
#define ENABLE_SYNC_TX
#if (COM_PORT < 4)
#define COM_USART __usart__(COM_PORT)
#define COM_IRQ __helper__(USART, COM_PORT, _IRQn)
#if (!defined(ENABLE_SYNC_TX) || !defined(ENABLE_SYNC_RX))
#define mcu_serial_isr __helper__(USART, COM_PORT, _IRQHandler)
#endif
#define COM_OUTREG (COM_USART)->DR
#define COM_INREG (COM_USART)->DR
#if (COM_PORT == 1)
#define COM_APB APB2ENR
#define COM_APBEN __helper__(RCC_APB2ENR_USART, COM_PORT, EN)
#else
#define COM_APB APB1ENR
#define COM_APBEN __helper__(RCC_APB1ENR_USART, COM_PORT, EN)
#endif
#else
#define COM_USART __uart__(COM_PORT)
#define COM_IRQ __helper__(UART, COM_PORT, _IRQn)
#if (!defined(ENABLE_SYNC_TX) & !defined(ENABLE_SYNC_RX))
#define mcu_serial_isr __helper__(UART, COM_PORT, _IRQHandler)
#endif
#define COM_APB APB1ENR
#define COM_APBEN __helper__(RCC_APB1ENR_, COM_UART, EN)
#define COM_OUTREG (COM_USART)->DR
#define COM_INREG (COM_USART)->DR
#endif
#else
#if (defined(USB_DP_PORT) && defined(USB_DP_BIT))
#ifndef USB_VCP
#define USB_VCP
//this MCU does not work well with both TX and RX interrupt
//this forces the sync TX method to fix communication
#define ENABLE_SYNC_TX
#define ENABLE_SYNC_RX
#endif
#define mcu_usb_isr USB_HP_CAN1_TX_IRQHandler
#define mcu_usb_isr USB_LP_CAN1_RX0_IRQHandler
#define mcu_usb_isr USBWakeUp_IRQHandler
#define USB_DP 100
#define USB_DP_APB2EN (__rccapb2gpioen__(USB_DP_PORT))
#define USB_DP_GPIO (__gpio__(USB_DP_PORT))
#if (USB_DP_BIT < 8)
#define USB_DP_CROFF USB_DP_BIT
#define USB_DP_CR CRL
#else
#define USB_DP_CROFF (USB_DP_BIT & 0x05)
#define USB_DP_CR CRH
#endif
#define DIO100 USB_DP
#define DIO100_PORT USB_DP_PORT
#define DIO100_BIT USB_DP_BIT
#define DIO100_APB2EN USB_DP_APB2EN
#define DIO100_GPIO USB_DP_GPIO
#define DIO100_CR USB_DP_CR
#define DIO100_CROFF USB_DP_CROFF
#define USB_DM 101
#define USB_DM_APB2EN (__rccapb2gpioen__(USB_DM_PORT))
#define USB_DM_GPIO (__gpio__(USB_DM_PORT))
#if (USB_DM_BIT < 8)
#define USB_DM_CROFF USB_DM_BIT
#define USB_DM_CR CRL
#else
#define USB_DM_CROFF (USB_DM_BIT & 0x05)
#define USB_DM_CR CRH
#endif
#define DIO101 USB_DM
#define DIO101_PORT USB_DM_PORT
#define DIO101_BIT USB_DM_BIT
#define DIO101_APB2EN USB_DM_APB2EN
#define DIO101_GPIO USB_DM_GPIO
#define DIO101_CR USB_DM_CR
#define DIO101_CROFF USB_DM_CROFF
#endif
#endif

